In [51]:
import pandas as pd
import numpy as np

In [52]:
# 创建数据
df = pd.DataFrame({'id': np.random.randint(0, 2000, 13),
                   'age': np.random.randint(20, 60, 13),
                    })

1. SELECT * FROM data;

In [53]:
df

      id  age
0    992   41
1   1619   54
2    531   50
3   1931   34
4   1161   38
5   1946   45
6   1530   55
7     77   20
8   1770   48
9    397   55
10  1601   57
11  1915   47
12  1596   43

2. SELECT * FROM data LIMIT 10;

In [54]:
df.head(10)

     id  age
0   992   41
1  1619   54
2   531   50
3  1931   34
4  1161   38
5  1946   45
6  1530   55
7    77   20
8  1770   48
9   397   55

3. SELECT id FROM data;  //id 是 data 表的特定一列

In [55]:
df['id']

0      992
1     1619
2      531
3     1931
4     1161
5     1946
6     1530
7       77
8     1770
9      397
10    1601
11    1915
12    1596
Name: id, dtype: int32

4. SELECT COUNT(id) FROM data;

In [56]:
df['id'].count()

13

5. SELECT * FROM data WHERE id<1000 AND age>30;

In [57]:
df[(df['id'] < 1000) & (df['age'] > 30)]

    id  age
0  992   41
2  531   50
9  397   55

In [58]:
# 创建新的数据
import random
df1 = pd.DataFrame({'id': [random.choice([1, 2, 3, 10]) for _ in range(6)],
                    'order_id': random.sample(range(10), 6),
                    })
df2 = pd.DataFrame({'id': random.sample(range(10), 6),
                    'column_name': random.sample(range(10), 6),
                    })
print(df1)
print(df2)

   id  order_id
0   1         8
1   2         3
2   1         1
3   2         4
4  10         2
5  10         9
   id  column_name
0   7            5
1   3            2
2   5            6
3   8            9
4   0            3
5   2            1

6. SELECT id,COUNT(DISTINCT order_id) FROM table1 GROUP BY id;

In [60]:
df1.groupby('id').agg({'order_id': 'nunique'})

    order_id
id
1          2
2          2
10         2

7. SELECT * FROM table1 t1 INNER JOIN table2 t2 ON t1.id = t2.id;

In [61]:
pd.merge(df1, df2, on='id')

   id  order_id  column_name
0   2         3            1
1   2         4            1

8. SELECT * FROM table1 UNION SELECT * FROM table2;

In [85]:
# 若两表字段名完全一样，则不用重命名。
# 否则，第二个表的字段要转换为第一个表的字段名，再连接。
# 这样才与 SQL union 完全一致。SQL union all 去掉 drop_duplicates() 就是了。
pd.concat([df1, df2.rename(columns={x: y for x , y in zip(df2.columns, df1.columns)})], ignore_index=True).drop_duplicates()

    id  order_id
0    1         8
1    2         3
2    1         1
3    2         4
4   10         2
5   10         9
6    7         5
7    3         2
8    5         6
9    8         9
10   0         3
11   2         1

9. DELETE FROM table1 WHERE id=10;

In [91]:
df1

   id  order_id
0   1         8
1   2         3
2   1         1
3   2         4
4  10         2
5  10         9

In [97]:
# 找到 id = 10 的行标签（索引），然后按行标签进行删除
df1.drop(df1[df1['id'] == 10].index)

   id  order_id
0   1         8
1   2         3
2   1         1
3   2         4

10. ALTER TABLE table1 DROP COLUMN column_name;

In [99]:
df2.drop('column_name', axis=1)

   id
0   7
1   3
2   5
3   8
4   0
5   2

In [100]:
# 与上面相同
df2.drop(columns='column_name')

   id
0   7
1   3
2   5
3   8
4   0
5   2